# GetPartInstanceName

## Description
Return the unique name assigned to this part instance represented by the specified sub-object.<BR>
The sub-object must be an object that was tagged as a part.

```pascal
FUNCTION GetPartInstanceName(objectHandle : HANDLE): STRING;
```

```python
def vs.GetPartInstanceName(objectHandle):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The sub-object handle.|

## Examples
```pascal
resultStr := GetPartInstanceName(objectHandle);
```
```python
import vs

# Return the unique name assigned to this part instance represented by the
# specified sub-object.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer

name = vs.GetPartInstanceName(objectHandle)
vs.Message('GetPartInstanceName returned: ' + str(name))
```

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom